<net name="openVag.xml" version="10">
    <layers>
        <layer id="1" name="openVagLayer1" type="Const">
            <output>
                <port id="0"/>
                <port id="1"/>
            </output>
        </layer>
        <layer id="2" name="openVagLayer2" type="Const">
            <input>
                <port id="0"/>
                <port id="1"/>
            </input>
        </layer>
        <layer id="3" name="openVagLayer3" type="Const">
            <output>
                <port id="0"/>
            </output>
        </layer>
    </layers>
    <edges>
        <edge from-layer="1" from-port="0" to-layer="2" to-port="0"/>
        <edge from-layer="3" from-port="0" to-layer="2" to-port="1"/>
        <edge from-layer="1" from-port="1" to-layer="2" to-port="1"/>
    </edges>
</net>
